[
    {
        "id": "md_janissaries",
        "name": "Janissary",
        "source": "core",
        "tags": {},
        "contextdata": {},
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "Janissaries can be equipped with any weapon, armour and equipment from the Iron Sultanate Armoury.",
                "glossary": [{"val": "Iron Sultanate", "id": "kw_sultanate"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "The janissaries are the Sultanate’s elite warriors, raised from childhood in the arts of war. Captured during raids upon the desolate northern and eastern marches beyond the Iron Wall, they are subjected to rigorous martial training and indoctrination from an early age. On the battlefield, Janissaries excel at devastating counter-charges, crushing the enemy elite formations and acting as the bodyguard for high-ranking individuals."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 1,
            "ranged": 1,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_sultanate","kw_strong"],
        "abilities" : ["ab_countercharge"]
    },
    {
        "id": "md_azeb",
        "name": "Azeb",
        "source": "core",
        "tags": {},
        "contextdata": {},
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "Azebs can be equipped with any weapon, armour and equipment from the Iron Sultanate Armoury.",
                "glossary": [{"val": "Iron Sultanate", "id": "kw_sultanate"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "Azebs are soldiers recruited from the multitude of provinces of the sultanate, where every house in twenty is required to equip and provide a warrior to serve the Prince of Those Who Believe. They are often used by their superiors as light skirmishers to harass and tie down the enemies while the heavier troops close in for the kill."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": -1,
            "ranged": 0,
            "base": [25],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_sultanate"],
        "abilities" : []
    },
    {
        "id": "md_sultanatesapper",
        "name": "Sultanate Sapper",
        "source": "core",
        "tags": {},
        "contextdata": {},
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "Sappers are equipped with shovels. This equipment can never be removed. They can be equipped with any weapon, armour and equipment from the Iron Sultanate Armoury.",
                "glossary": [{"val": "Iron Sultanate", "id": "kw_sultanate"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "The Sultan’s Sappers are highly respected and valued specialists in the Sultan’s army. They are expected to man the great cannons of the Iron Wall no matter what the enemies throw at them, and since their mighty artillery is prone to overheating, they are easily identified by the terrible burns all over their bodies."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 0,
            "ranged": 1,
            "base": [25],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_sultanate"],
        "abilities" : ["ab_minesetting","ab_demine","ab_forwardpositions","ab_fortify"]
    },
    {
        "id": "md_brazenbull",
        "name": "Brazen Bull",
        "source": "core",
        "tags": {},
        "contextdata": {
            "model_equipment_restriction": {
                "required": [
                    {
                        "tag": "weapon",
                        "res_type": "keyword",
                        "value": "kw_heavy"
                    }
                ],
                "removed": [
                    {
                        "category": "equipment",
                        "res_type": "id",
                        "value": "eq_exlixerofalkhidr"
                    }
                ]
            },
            "model_equipment_limit": {
                "maximum": [
                    {
                        "tag": "weapon",
                        "res_type": "tag",
                        "value": "brazen_bull",
                        "limit": 2
                    }
                ]
            }
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "A Brazen Bull can be equipped with any weapon, armour and equipment from the Iron Sultanate Armoury. Due to its vast strength and size it can only use weapons with the Keyword HEAVY – it will simply crush weapons of normal size by accident. It can carry up to two Brazen Bull Only weapons.",
                "glossary": [
                    {"val": "HEAVY", "id": "kw_heavy"}
                ]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "The Brazen Bull is a monstrous being of immense power and vitality, capable of tearing even the bastard child of a devil clean in half. The Sultan’s armourers equip the Bulls with heavy artillery that even the superhuman Janissaries cannot lift, let alone use in battle: flame cannons, volley guns and holy blades blessed by the Word of the Great Protector."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 2,
            "ranged": 0,
            "armour": 0,
            "movetype": 0,
            "potential": 1,
            "base": [60]
        },
        "keywords" : ["kw_sultanate","kw_strong","kw_tough","kw_fear"],
        "abilities" : ["ab_artificialbody","ab_trample"]
    },
    {
        "id": "md_lionofjabir",
        "name": "Lion of Jabir",
        "source": "core",
        "tags": {},
        "contextdata": {
            "unarmed_penalty_remove": { },
            "stat_options": { 
                "options": [
                    [
                        {
                            "base": [50]
                        },
                        {
                            "base": [30,60]
                        }
                    ]
                ]
            },
            "model_equipment_restriction": {
                "removed": [
                    {
                        "tag": "shield",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "category": "melee",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "category": "ranged",
                        "res_type": "all",
                        "value": ""
                    }
                ],
                "required": [
                    {
                        "category": "equipment",
                        "res_type": "id",
                        "value": "eq_windamulet"
                    }
                ]
            }
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "Lions can be equipped with armour (except shields) and Wind Amulets. They cannot be equipped with any other items. They do not suffer penalties for fighting unarmed. You can mount the Lion on two different base sizes as indicated in the profile due to the variance of their shape and size."
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "Named after the deadly hunters of the plains, the Lions of Jabir can take many forms, not all of them leonine. Each one is a unique masterwork, grown according to the skills and artistry of the Jabirean scientist that created them. The speed and ferocity of the Lions is nearly unmatched, and some even have strange powers granted by their alchemical birth."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 8,
            "melee": 1,
            "armour": 0,
            "movetype": 0,
            "potential": 1
        },
        "keywords" : ["kw_sultanate"],
        "abilities" : ["ab_artificialbody","ab_mauling","ab_lionsgrace"]
    },
    {
        "id": "md_jabireanalchemist",
        "name": "Jabirean Alchemist",
        "source": "core",
        "tags": {},
        "contextdata": {},
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Alchemist can be equipped with any weapon, armour and equipment from the Iron Sultanate Armoury.",
                "glossary": [{"val": "Iron Sultanate", "id": "kw_sultanate"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "The Jabirean Alchemist is a master of esoteric powers, able to control fire and ice, metal and liquid; capable of creating intricate mechanical devices and artificial life as well as weapons of calamitous potency. In exchange for the freedom to practise their arts, the Alchemists supply the Sultanate with the peerless Jabirean battle lions, and serve on the front lines where their devastating alchemical compounds melt the flesh from the bones of the Unbelievers, or dissolve through even the toughest enemy armour."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 1,
            "ranged": 2,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_sultanate","kw_elite"],
        "abilities" : ["ab_masteryoftheelements"]
    },
    {
        "id": "md_yuzbasicaptain",
        "name": "Yüzbaşı Captain",
        "source": "core",
        "tags": {},
        "contextdata": {},
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "Yüzbaşı can be equipped with any weapon, armour and equipment from the Iron Sultanate Equipment List.",
                "glossary": [{"val": "Iron Sultanate", "id": "kw_sultanate"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "Military expeditions over the Great Iron Wall into No Man’s Land carry many risks, and their commanders are field officers known as Yüzbaşı. They are expected to lead from the front and their selection is solely on merit, with no consideration given to family pedigree or wealth."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 2,
            "ranged": 2,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_sultanate","kw_elite", "kw_tough","kw_leader"],
        "abilities" : ["ab_mubarizun"]
    },
    {
        "id": "md_sultanateassassin",
        "name": "Sultanate Assassin",
        "source": "core",
        "tags": {},
        "contextdata": {},
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Assassin can be equipped with any weapon, armour and equipment from the Iron Sultanate Equipment List.",
                "glossary": [{"val": "Iron Sultanate", "id": "kw_sultanate"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "Assassins are a legendary order of mystic warriors, whispered about the world over for their secrecy and ruthlessness. Assassins are able to bend space and time using the sacred rituals and powerful hallucinogens discovered by magi of the order. With this esoteric power they prowl behind enemy lines, hunting their targets with merciless efficiency. They can seemingly appear in two places simultaneously, strike a foe with startling speed and then travel back into time to a moment a few heartbeats before, safe from any retaliation."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 2,
            "ranged": 1,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_sultanate","kw_elite", "kw_infiltrator"],
        "abilities" : ["ab_timeslip","ab_temporalassassin"]
    },
    {
        "id": "md_mamlukfaris",
        "name": "Mamluk Faris",
        "source": "core",
        "tags": {},
        "contextdata": {},
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "A Mamluk carries a Jezzail with Alchemical Ammunition. They wear a Helmet and Reinforced Armour. In addition, before each battle, you may choose one of several loadouts from their personal armoury"
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "Mamluks are an echo of a bygone age, last members of the warrior-elite that once ruled a great empire in Northern Africa. They suffered grievous losses at the earliest stages of the Great War when the Legions of demon Zalambuer emerged from the Hellgate. The Fatimids led their Mamluk forces in a desperate campaign to reclaim the Levant, but of their fate there is no tale. Instead of returning victorious warriors, the slaves of Jahannam rushed through Sinai like an evil wind, razing Alexandria and Cairo to the ground. The remaining Mamluks fought bitterly to protect their homes, but to no avail. Too proud to leave their ancestral homes at the mercy of evil, some of the last Mamluks did not heed the call to migrate beyond the Iron Wall, and instead dispersed throughout the lands they once ruled to fight on – a fight that has never ceased since those dark days."
            },  
            {"tags": {"desc_type" : "gap"}},  
            {
                "tags": {"desc_type" : "italic"},
                "content": "To this day the Mamluk knights play a deadly game of ambush and sudden raids on the Aegyptian front against Mammon’s legions, making their living as swords for hire, waging an endless war against the Heretics and composing poems of lamentation in memory of their lost and devastated homelands. Generations of war have hardened the Mamluks into peerless warriors, for parents pass on the secrets of Furūsiyya, the martial skills and ethical conduct of the Arabian Knights, to their children. Too few in numbers to wage open war, the Mamluks instead fight alongside any of the Peoples of the Book, making their living by offering their swords to the highest bidder, as long as such a leader promises to fight the forces of Shaytan. They respect noble character and martial prowess above all, and often bond by sharing their way of the sword with an ally they respect."
            },  
            {"tags": {"desc_type" : "gap"}},  
            {
                "tags": {"desc_type" : "italic"},
                "content": "Only a few of the famed artificial heavy warhorses of the Mamluks remain, and they are not risked in open combat unless they are used directly to defend the last few hidden abodes the Mamluks still inhabit in the vast deserts that stretch beyond the Nile delta. However, these tireless steeds are used to take the heavy Mamluk warriors into advanced positions where they can disrupt the enemy’s plans and surprise exposed enemy units."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 1,
            "ranged": 1,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "mercenary": true
        },
        "keywords" : [],
        "abilities" : ["ab_swornsword","ab_martialprowess","ab_arabiandestrier"]
    },
    {
        "id": "md_takwincreation",
        "name": "Takwin Homunculus",
        "source": "core",
        "tags": {},
        "contextdata": {
            
            "model_equipment_restriction": {
                "removed": [
                    {
                        "category": "equipment",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "category": "melee",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "category": "ranged",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "category": "armour",
                        "res_type": "all",
                        "value": ""
                    }
                ]
            }
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The homunculus cannot be equipped with any weapons, armour or equipment. It can fight in melee without any penalty."
            },
            { "tags": {"desc_type" : "gap"} },
            {
                "tags": {"desc_type" : "default"},
                "content": "You can bring one Takwin creature for each Alchemist in your warband. Each Takwin creature must be associated with an Alchemist in your warband. If a Takwin creature’s associated Alchemist is killed (typically by acquiring three scars), that Takwin creature cannot be fielded, its equipment cannot be changed and no Alchemical Formulae may be applied to it. When you acquire a new Alchemist, if you have any unallocated Takwin creatures, you must allocate that new Alchemist with one of your unallocated Takwin creatures. Instead of using Glory, you must buy them with ducats as indicated on the list below."
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "To become an Alchemist is no easy task: they undergo many trials on their path to mastery. The second is to create a takwin servant, a Homunculus creature of artificial life and intellect. If the candidate manages to follow the complex formula, as well as the intricate timing and temperature requirements, the creature will emerge after forty days of toil. It will act as the Alchemist’s living tool of creation, for their hands have fine motor skills well beyond even the nimblest craftsman. "
            },  
            {"tags": {"desc_type" : "gap"}},  
            {
                "tags": {"desc_type" : "italic"},
                "content": "Vaguely shaped like a small human, it canchange the consistency of its body to an almost liquid-like slime to squeeze into alchemical chambers to do their master’s bidding in extreme temperatures and in the fog of poisonous chemical fumes. Many aspirants fail here and their creation emerges from its golden celestial sphere a deformed monstrosity, filled with hatred towards its creator. It burrows itself into the Alchemist’s body to consume it from within, wearing its would-be master as a skin."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 0,
            "ranged": 0,
            "base": [25],
            "armour": 0,
            "movetype": 0,
            "potential": 1
        },
        "keywords" : [],
        "abilities" : ["ab_artificialbody","ab_recreation"]
    },
    {
        "id": "md_scriptureguardian",
        "name": "Scripture Guardian",
        "source": "core",
        "tags": {},
        "contextdata": {
            "mercenary_add_equipment": {
                "additions": [
                    {
                        "type": "melee",
                        "hands": 2,
                        "unrestricted": true
                    }
                ]
            }
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Scripture Guardian carries a Scripture Scroll. It wears reinforced armour and a helmet. In addition, it has 2 arms that can be made to carry one Melee weapon available to your Warband as long as they have no restrictions (such as ELITE only, Assassins only, LIMIT: 2 etc.). You must pay the appropriate cost as standard.",
                "glossary": [{"val": "ELITE", "id": "kw_elite"},{"val": "LIMIT", "id": "kw_limit"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "The Origins of the Scripture Guardians are unknown, but rumours claim they are creations of great masters of Kabbalah. Reports of the Scripture Guardians began to circulate in the early days of the Great War. The destruction of Jerusalem upended great cities and unearthed tombs that should never have been disturbed, their occupants now wandering this unhappy land, endlessly reciting the sacred writings entrusted to them in death. Sometimes a lucky expedition to No Man’s Land can find such a creature, and placing a holy text of their own faith into its hands can turn the Scripture Guardian into a potent ally to whomever aligns with the holy (or indeed desecrated) scroll of tome given to its unyielding grasp."
            },  
            {"tags": {"desc_type" : "gap"}},  
            {
                "tags": {"desc_type" : "italic"},
                "content": "Capable of speaking and reading the One True Language, the Scripture Guardian can unleash the powers it calls upon against anyone its master dictates. It serves its purpose with the single-mindedness of an automaton, unthinking and uncaring. Spoken by the Guardian, the words are empowered with the primordial power of Creation, and can unmake anything, growing in power the longer they target anything in the physical world."
            }
        ],
        "team": "none",
        "stats" : {            
            "movement": 6,
            "melee": 1,
            "ranged": 1,
            "base": [40],
            "armour": 0,
            "movetype": 0,
            "mercenary": true
        },
        "keywords" : ["kw_golem"],
        "abilities" : ["ab_slow","ab_vengefulscripture"]
    },
    {
        "id": "md_trenchdog",
        "name": "Trench Dog",
        "source": "core",
        "tags": {},
        "contextdata": {
            "unarmed_penalty_remove": {}
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "Dogs do not suffer penalties for fighting unarmed. In battle they are treated as non-ELITE Troops. War Dogs cannot become ELITE. At an additional cost of +1 Glory Point the any dog gains an ability to form a FIRETEAM with any 1 model in your Warband.",
                "glossary": [{"val": "ELITE", "id": "kw_elite"},{"val": "FIRETEAM", "id": "kw_fireteam"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "A great many animals serve in the trenches alongside the soldiers. Wardogs are by far the most common, but tame ocelots, barbary apes, small bears, and other unusual pets abound, while the forces of Hell keep Hellhounds and other infernal beasts as pets."
            },   
            {
                "tags": {"desc_type" : "italic"},
                "content": "These loyal canines can be trained to serve in multiple roles: as mercy dogs for on rescuing wounded soldiers, fierce guard dogs, or as messengers."
            }
        ],
        "team": "none",
        "stats" : {            
            "movement": 8,
            "melee": 0,
            "base": [25],
            "armour": 0,
            "movetype": 0,
            "potential": 3
        },
        "keywords" : [],
        "abilities" : ["ab_fourpaws"]
    },
    {
        "id": "md_deathcommando",
        "name": "Death Commando",
        "source": "core",
        "tags": {},
        "contextdata": {
            "model_equipment_restriction": {
                "required": [
                    {
                        "category": "ranged",
                        "res_type": "id",
                        "value": "eq_silenecedpistol"
                    },
                    {
                        "category": "ranged",
                        "res_type": "id",
                        "value": "eq_tormentorchain"
                    },
                    {
                        "category": "ranged",
                        "res_type": "id",
                        "value": "eq_gasgrenades"
                    }
                ]
            }
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Death Commando can be equipped with any weapon, armour or equipment from the Heretic Legion Armoury. The only ranged weapons they can be equipped with are Silenced Pistols, a Tormentor Chain and Gas Grenades.",
                "glossary": [{"val": "Heretic Legion", "id": "kw_heretic"}]
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "italic"},
                "content": "Silent Killers equipped with stealth generators that hide them from the eyes of God. These terrifying infiltrators have been known to kill entire enemy squads alone."
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": 2,
            "ranged": 1,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_elite","kw_infiltrator","kw_elite"],
        "abilities" : ["ab_hide","ab_stealthgenerator"]
    },
    {
        "id": "md_annointedheavyinfantry",
        "name": "Annointed Heavy Infantry",
        "source": "core",
        "tags": {},
        "contextdata": {
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "Anointed are always equipped with a suit of Reinforced Armour and Infernal brand mark which are included in the cost. This armour can never be removed. Otherwise they can be equipped with any weapon, armour or equipment from the Heretic Legion Armoury and may purchase a Trench Shield.",
                "glossary": [{"val": "Heretic Legion", "id": "kw_heretic"}]
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "italic"},
                "content": "Heavily armed and armoured assault troops. Their skin is burned and blistering from their ordained pilgrimages to Hell and back."
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": 1,
            "ranged": 1,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_heretic","kw_strong"],
        "abilities" : []
    },
    {
        "id": "md_heretictrooper",
        "name": "Heretic Trooper",
        "source": "core",
        "tags": {},
        "contextdata": {
        },
        "description": [
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "The Heretic Trooper can be equipped with any weapon, armour or equipment from the Heretic Legion Armoury.",
                "glossary": [{"val": "Heretic Legion", "id": "kw_heretic"}]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "You can upgrade up to half (rounding down) of your Heretic Troopers into Heretic Legionnaires at the cost of +10 ducats each. You can select to upgrade either the Ranged or Melee characteristic of any of your Legionnaires by +1 DICE. You can choose a different bonus for each Legionnaire.",
                "glossary": [{"val": "+1 DICE", "id": "kw_plusdice"}]
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "italic"},
                "content": "These soldiers make up the bulk of the Heretic forces. They have witnessed the Gate of Hell and survived, damning them for all eternity."
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": 0,
            "ranged": 0,
            "base": [25],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_heretic"],
        "abilities" : []
    },
    {
        "id": "md_hereticpriest",
        "name": "Heretic Priest",
        "source": "core",
        "tags": {},
        "contextdata": {
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Heretic Priest can be equipped with any weapon, armour or equipment from the Heretic Legion Armoury.",
                "glossary": [{"val": "Heretic Legion", "id": "kw_heretic"}]
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "italic"},
                "content": "The Leader of a Heretic warband. These fallen priests perform all kinds of unholy magics, summoning petrifying demons and creatures using their Goetic spells. Often pledged to a Demon Lord in Hell, such as Pazuzu or Guison, the Profane Gospels they recite terrify church forces, causing ears to bleed and eyeballs to burst in their sockets."
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": 1,
            "ranged": 1,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_elite","kw_heretic","kw_tough","kw_leader"],
        "abilities" : ["ab_puppetmaster"]
    },
    {
        "id": "md_heretichorister",
        "name": "Heretic Chorister",
        "source": "core",
        "tags": {},
        "contextdata": {
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Heretic Chorister can be equipped with any weapon, armour or equipment from the Heretic Legion Armoury.",
                "glossary": [{"val": "Heretic Legion", "id": "kw_heretic"}]
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Suicide is a Mortal Sin, and sacrificing yourself to the glory of Hell is a yet greater affront to God. Some Heretics born with a gift of sonorous voice but little prospects of rising through the ranks but possessing a determination to excel may pursue the dark path of becoming a Chorister."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Such supplicants go to one of the black altars of Heretic abodes at the bottom of the deep inverted pyramid temples dedicated to the greatest of Arch-devils. There they are dressed in the robes of dark devotion, lie on the altar and mutilate themselves to death by carving unholy runes into their flesh. The more wounds they can suffer before perishing, the more pleasing it is said their offering is. The most devout slice their own throats, trying to cut as deep as they can before their miserable life leaves them."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Most such wretches go to their doom in the Lake of Fire, but some are reborn as Choristers after nine days. Their corpses lurch back to their feet, and finish their grisly beheading, and lift their severed heads that begin to sing hymns they have learned in the Inferno. From their self-inflicted wounds spurts cold blood that forms diabolic symbols and changes to match the words of their unholy chorale. They head towards the front lines driven by a call no living can hear and join the Heretic warband of their choosing."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "As their severed heads sing their agonising hymns, the minds of their enemies are filled with visions from the Pits of Hell, weakening both the resolve and strength of those unfortunate enough to hear the dire song of a Chorister. Their hymns are often the first thing a fresh recruit experiences on the battlefield, as their unholy voice rolls across the trenches, proclaiming a never-ending prophecy of the final victory of Hell over Heaven."
                    }
                ]
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": 2,
            "ranged": -2,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_elite","kw_heretic","kw_fear"],
        "abilities" : ["ab_unholyhymns"]
    },
    {
        "id": "md_warwolfassaultbeast",
        "name": "War Wolf Assault Beast",
        "source": "core",
        "tags": {},
        "contextdata": {            
            "model_equipment_restriction": {
                "removed": [
                    {
                        "category": "equipment",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "category": "melee",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "category": "ranged",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "category": "armour",
                        "res_type": "all",
                        "value": ""
                    }
                ]
            }
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "You cannot buy additional equipment, weapons or armour for War Wolves. Each War Wolf is encased in a nigh impregnable suit of Tartarus Armour that is reflected in its profile above. Additionally, each War Wolf has a set of Shredding Claws and a vicious Chainsaw Mouth. These pieces of equipment are built into the integrity of its construction and cannot be removed or lost in any way. The weapons are detailed below. The War Wolf may make one attack ACTION with each of these weapons in Melee Combat and may make no other attacks during its Activation (so it can make two attacks per Activation).",
                "glossary": [{"val": "ACTION", "id": "kw_action"}]
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "italic"},
                "content": "This abomination charges through miles of barbed wire to clear a path for the heretic infantry; its uniquely formed head designed to cut clean through it. War Wolves wear unique armour forged in the factories of hell, as seen by the maker’s marks stamped upon it."
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 8,
            "melee": 2,
            "base": [50],
            "armour": -3,
            "movetype": 0,
            "potential": 1
        },
        "keywords" : ["kw_fear","kw_heretic","kw_tough","kw_artificial"],
        "abilities" : ["ab_lopingdash"]
    },
    {
        "id": "md_artillerywitch",
        "name": "Artillery Witch",
        "source": "core",
        "tags": {},
        "contextdata": {            
            "model_equipment_restriction": {
                "removed": [
                    {
                        "category": "ranged",
                        "res_type": "all",
                        "value": ""
                    }
                ]
            }
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "An Artillery Witch is always equipped with an endless supply of Infernal Bombs (see below) and can carry no other ranged weapons. Otherwise, she can be equipped with any melee weapon, armour or equipment from the Heretic Legion Armoury.",
                "glossary": [{"val": "Heretic Legion", "id": "kw_heretic"}]
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Suicide is a Mortal Sin, and sacrificing yourself to the glory of Hell is a yet greater affront to God. Some Heretics born with a gift of sonorous voice but little prospects of rising through the ranks but possessing a determination to excel may pursue the dark path of becoming a Chorister."
                    }
                ]
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": -1,
            "ranged": 0,
            "base": [25],
            "armour": 0,
            "movetype": 0,
            "potential": 1
        },
        "keywords" : ["kw_heretic","kw_artificial"],
        "abilities" : ["ab_levitate","ab_artificiallife"]
    },
    {
        "id": "md_wretched",
        "name": "Wretched",
        "source": "core",
        "tags": {},
        "contextdata": {            
            "model_equipment_restriction": {
                "removed": [
                    {
                        "category": "ranged",
                        "res_type": "all",
                        "value": ""
                    },
                    {
                        "res_type": "ducat",
                        "value": 10,
                        "param": "maximum"
                    }
                ]
            }
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Wretched can be equipped with any melee weapon, armour or equipment from the Heretic Armoury List. None of their weapons, armour or equipment can cost more than 10 ducats each. Every Wretched must be equipped with at least one weapon.",
                "glossary": [{"val": "Heretic Armoury", "id": "kw_heretic"}]
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Many unfortunates fall into the hands of the Heretic warbands, either during one of their many raids or battles, or purchased from the slave markets within their own territories. Some are foolhardy adventurers who travel into the domains of the damned only to be caught by their watchful patrols."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Their lot is grim and terrible. They are worked to death in the factories of Sixty-Six Lords, butchered for meat, or worst of all, sold or offered to the agents of the Court of the Seven-Headed Serpent to be used as raw power for Goetic Spells."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Yet one path to freedom exists: they can volunteer to serve in the Legions as the lowest of low, the most disposable of penal troops. For the law of Hell is clear: those who rebel against God can gain their freedom if they are deemed to have performed sufficiently great deeds. Thus it is no wonder that many Heretic warbands drive swarms of the Wretched ahead of them to blunt and slow down the enemy assaults."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Wretched are branded with cursed flesh-eating tattoos as a safeguard against escape and heavily drugged to degrade and dull their will, while still leaving their aggression intact. Heretic Elites discard the lives of the Wretched carelessly, as their sacrifice on the battlefield counts as a worthy deed which will be rewarded by their Patrons."
                    }
                ]
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": -1,
            "ranged": -1,
            "base": [25],
            "armour": 0,
            "movetype": 0,
            "potential": 2
        },
        "keywords" : [],
        "abilities" : ["ab_lawofhell","ab_darkblessing","ab_chattel"]
    },
    {
        "id": "md_sineater",
        "name": "Sin Eater",
        "source": "core",
        "tags": {},
        "contextdata": {    
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Sin Eater is equipped with Reinforced Armour and a 2-handed Tenderizer Maul. You cannot alter the Sin Eater’s weapons and equipment in any way."
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Sin Eaters are horrific creatures: once they were mortal men and women, but their overwhelming greed and hunger for human flesh tainted with Sin, combined with the corrupting influence of the Hellgate, has turned them into a form that matches their inner foulness. They’re swollen into monstrous proportions and are always at a point of nearly bursting, yet forever ravenous for more flesh and human sins to devour."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "The Sin Eater is one of the very few creatures that Beelzebub approves of outside his own followers due its insatiable gluttony."
                    }
                ]
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": 2,
            "base": [50],
            "armour": 0,
            "movetype": 0,
            "mercenary": true,
            "potential": 2
        },
        "keywords" : ["kw_heretic","kw_fear","kw_tough","kw_strong"],
        "abilities" : ["ab_devourtheguilty","ab_vomit"]
    },
    {
        "id": "md_goeticwarlock",
        "name": "Goetic Warlock",
        "source": "core",
        "tags": {},
        "contextdata": {  
            "modify_equipment_block": {}  
        },
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The Warlock wears Reinforced Armour. A Warlock counts as being armed with two swords in Melee combat – its arms are deadly weapons in their own right. You cannot alter the Warlock’s weapons and equipment in any way."
            }
        ],
        "lore": [ 
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Goetic Warlocks are horrific creations from the death factories of the 3rd Circle of Hell, manufactured from captured priests, prophets, vicars, rectors and monks. Fiendish machines first burn their flesh away with hellfire, encasing the still-living skeletons in an infernal suit of armour and stamping them with goetic runes. The process is so agonising that they consent to a demonic pact to bring end to their pain. Thus a new Goetic Warlock is born, ready to hunt the living they once swore to protect."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "The mere gaze of the warlock causes necrosis and in close quarters they embrace unsuspecting enemies with their iron claws, using their goetic magic to gate themselves to a secluded location where they can finish their victim by slowly shredding them apart. Their favourite method is by skinning their victims alive and using their gruesome trophies as repulsive vellum to write grimoires and unholy religious texts, or wearing the faces of their victims to power their illusionary spells to confound their enemies."
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [                    
                    {
                        "tags": {"desc_type" : "italic"},
                        "content": "Due to the rarity of victims required to create Goetic Warlocks, they are only assigned to the Heretic commanders with the greatest renown, need and with the right connections in the twisted web of Heretic politics. Mammon, the great devil of Greed, sells the services of his own personal battalion of Warlocks to the highest bidder."
                    }
                ]
            }
        ],
        "team": "hell",
        "stats" : {            
            "movement": 6,
            "melee": 1,
            "ranged": 1,
            "base": [40],
            "armour": 0,
            "movetype": 0,
            "mercenary": true,
            "potential": 2
        },
        "keywords" : ["kw_demonic","kw_fear","kw_artificial"],
        "abilities" : ["ab_goeticportal","ab_barbedembrace","ab_goeticgaze"]
    },
    {
        "id": "md_warprophet",
        "name": "War Prophet",
        "source": "core",
        "tags": {},
        "contextdata": {},
        "description": [
            {
                "tags": {"desc_type" : "default"},
                "content": "The War Prophet can be equipped with any weapons, armour or equipment from the Trench Pilgrims Equipment List.",
                "glossary": [{"val": "Trench Pilgrims", "id": "kw_pilgrim"}]
            }
        ],
        "lore": [      
            {
                "tags": {"desc_type" : "italic"},
                "content": "A charismatic leader and powerful fighter of the Pilgrim group. They are driven by visions of Armageddon, and their preaching and prophecies drive the pilgrimage from one battlefield to the next, as they seek to thwart the forces of Satan and find martyrdom in combat."
            }
        ],
        "team": "faithful",
        "stats" : {            
            "movement": 6,
            "melee": 2,
            "ranged": 2,
            "base": [32],
            "armour": 0,
            "movetype": 0,
            "potential": 0
        },
        "keywords" : ["kw_pilgrim","kw_elite", "kw_leader"],
        "abilities" : ["ab_loudspeakers","ab_layingonhands","ab_mementomori"]
    }
]