[
    {
        "id": "sr_nominatedelites",
        "source": "core",
        "tags": { },
        "contextdata": { },
        "name": "Nominated Elites",
        "description":  [
            {
            "tags": {"desc_type" : "default"},
            "content": "After the deployment, in secret, both players nominate three enemy ELITE models as targets to be eliminated (unless the opponent has a smaller number of ELITE in which case nominate all of them). Each player also nominates one of their own ELITE models that must be kept alive until the end of the game. These score additional Victory Points at the end of the game as follows.",
            "glossary": [{"val": "ELITE", "id": "kw_elite"}]
            }
        ],
        "options": []
    },
    {
        "id": "sr_trenches",
        "source": "core",
        "tags": { },
        "contextdata": { },
        "name": "Trenches",
        "description":  [
            {
            "tags": {"desc_type" : "default"},
            "content": "The Defender places three 8”-long Trench sections in their Deployment Zone. They can be placed as the Defender wishes and can be continuous, but each section always counts separately for Victory Points (see below)."
            }
        ],
        "options": []
    },
    {
        "id": "sr_mines",
        "source": "core",
        "tags": { },
        "contextdata": { },
        "name": "Mines",
        "description":  [
            {
            "tags": {"desc_type" : "paragraph"},
            "content": "The Defender then places 12 mine markers on the battlefield, four which will be duds – the defender marks the duds on the side of the marker that is hidden from view (face down). The Defender can place the mines anywhere within the battlefield up to 12” away from their own Deployment Zone as shown, though not inside their own deployment zone."
            },
            {
            "tags": {"desc_type" : "paragraph"},
            "content": "When any model comes within 2” of the centre of a mine counter (players can measure this distance beforehand), flip the counter over to see if it is a dud or not. If the mine is a dud, discard it immediately. If the mine is not a dud, every model within 3” must immediately roll on the Injury Chart to see what happens as a result of the exploding mine. The mines have the Keyword SHRAPNEL, so the models hit by the mine blast suffer an additional BLOOD MARKER unless they have protection against this. Afterwards, remove the mine marker. It is possible to trigger more than one mine at the time.",
            "glossary": [
                {"val": "SHRAPNEL", "id": "kw_shrapnel"},
                {"val": "BLOOD MARKER", "id": "kw_bloodmarker"}
            ]
            },
            {
            "tags": {"desc_type" : "paragraph"},            
            "content": "Some models, such as New Antioch Combat Engineers can remove a mine counter by moving in base contact with it and passing a RISKY ACTION as indicated in their warband entry. Note that when a model attempts this, the mine does not explode until the result of the roll is determined.",
            "glossary": [{"val": "RISKY ACTION", "id": "kw_riskyaction"}]
            }
        ],
        "options": []
    },
    {
        "id": "sr_morale",
        "source": "core",
        "tags": { },
        "contextdata": { },
        "name": "Morale",
        "description":  [
            {
            "tags": {"desc_type" : "default"},
            "content": "This is a fight to the finish, so a failed Morale Test will not end the battle. Instead, any warband that fails their Morale Test will be shaken instead. It is possible for both warbands to be shaken."
            }
        ],
        "options": []
    },
    {
        "id": "sr_gunturret",
        "source": "core",
        "tags": { },
        "contextdata": { },
        "name": "Gun Turret",
        "description":  [
            {
            "tags": {"desc_type" : "equipment"},
            "content": "eq_gunturret"
            }
        ],
        "options": []
    },
    {
        "id": "sr_mortar",
        "source": "core",
        "tags": { },
        "contextdata": { },
        "name": "Mortar",
        "description":  [
            {
            "tags": {"desc_type" : "equipment"},
            "content": "eq_mortar"
            }
        ],
        "options": []
    },
    {
        "id": "sr_trainwagons",
        "source": "core",
        "tags": { },
        "contextdata": { },
        "name": "Train Wagons",
        "description":  [
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "The derailed train has three wagons. Each wagon is 4” wide (W), 8” long (L) and 5” high (H). The wagons have a set of ladders on both sides, allowing models to climb on top of a wagon as part of their standard Move. A wagon also provides cover to a model that is in base contact with it."
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "The train was carrying supply crates, containing precious weapons, materials and holy relics. The supply crates are spread between the three wagons."
            },
            {
                "tags": {"desc_type" : "paragraph"},            
                "content": "Place three initial markers representing Objectives on the table as indicated on the map. These markers represent an X quantity of supply crates inside a wagon. The wagons are all closed, making it impossible to see the contents inside."
            },
            {
                "tags": {"desc_type" : "paragraph"},            
                "content": "A wagon can be opened from either side by a model within 1”. The model must roll on the Action Success Chart to force open a wagon’s door. BLOOD MARKERS and BLESSING MARKERS can be used to hinder, or aid, this Action.",
                "glossary": [
                    {"val": "BLESSING MARKERS", "id": "kw_blessingmarker"},
                    {"val": "BLOOD MARKERS", "id": "kw_bloodmarker"}
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},            
                "content": "Upon opening a wagon, the player must then roll a D3:"
            },
            {
                "tags": {"desc_type" : "headless_table"},
                "content": "",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "table_row"},
                        "content": "",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "table_item"},
                                "content": "1"
                            },
                            {
                                "tags": {"desc_type" : "table_item"},
                                "content": "There is one supply crate inside the wagon: Place one Objective Marker beside the model who opened the wagon to represent the crate and remove the previous marker from the table."
                            }
                        ]
                    },
                    {
                        "tags": {"desc_type" : "table_row"},
                        "content": "",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "table_item"},
                                "content": "2"
                            },
                            {
                                "tags": {"desc_type" : "table_item"},
                                "content": "There are two supply crates inside the wagon: Place two Objective Markers beside the model who opened the wagon to represent the crates and remove the previous marker from the table."
                            }
                        ]
                    },
                    {
                        "tags": {"desc_type" : "table_row"},
                        "content": "",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "table_item"},
                                "content": "3"
                            },
                            {
                                "tags": {"desc_type" : "table_item"},
                                "content": "There are three supply crates inside the wagon: Place three Objective Markers beside the model who opened the wagon to represent the crates and remove the previous marker from the table."
                            }
                        ]
                    }
                ]
            }
        ],
        "options": []
    },
    {
        "id": "sr_supplycrates",
        "source": "core",
        "tags": { },
        "contextdata": { },
        "name": "Supply Crates",
        "description":  [
            {
                "tags": {"desc_type" : "paragraph"},            
                "content": "During the game, any model that ends its move in contact with a marker can Claim it, without the need for a roll, as long as they’re not engaged in melee combat. The model has then Claimed a crate. A model can end a Claim without the need for a roll at the start of the model’s Activation, dropping the crate within 1” of the model, in a direction of the model’s choice. The same model cannot make a new Claim during that Activation. A model can only Claim one crate at a time and must immediately choose one of the three following options:"
            },
            {
                "tags": {"desc_type" : "paragraph"},
                "content": "",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "list"},
                        "content": "",
                        "subcontent": [    
                            {
                                "tags": {"desc_type" : "default"},            
                                "content": "",
                                "subcontent": [                                    
                                    {
                                        "tags": {"desc_type" : "paragraph"},            
                                        "content": "",
                                        "subcontent": [
                                            
                                            {
                                                "tags": {"desc_type" : "bold"},            
                                                "content": "Extract Supplies: "
                                            },
                                            {
                                                "tags": {"desc_type" : "default"},            
                                                "content": "The model picks up the crate to start extracting it, without the need for a roll. The crates are HEAVY and must be held with all hands a model may have. Any weapons a model might be carrying, or is integrated with, will be rendered unusable while the model is extracting the crate. As long as a model is extracting the crate, it cannot Attack, cannot Dash and any other method of movement (teleportation, Puppet Master etc.) cannot be used to move the model due to the mystical effect of the holy relics inside, other than their standard Move.",
                                                "glossary": [
                                                    {"val": "HEAVY", "id": "kw_heavy"}
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "tags": {"desc_type" : "paragraph"},            
                                        "content": "At the end of its Activation, the model can pass the crate it is extracting to any friendly model within 1” range, as long as neither model is in melee combat with an enemy model. The model receiving the crate is considered to have ended their Activation this turn, if it has not yet done so. A model extracting a crate can drop it without the need for a roll or be forced to drop it if engaged in melee combat, dropping the crate within 1” of the model in a direction of the model owner’s choice."
                                    },
                                    {
                                        "tags": {"desc_type" : "paragraph"},            
                                        "content": "A model can also change its choice to Destroy Supplies (see below) without the need for a roll at any point. If a model extracting a crate moves into contact with any table edge, it has escaped with the crate successfully and does not return to the table, in which case remove the Objective Marker representing the extracted supplies from the table and the model that extracted it."
                                    }
                                ]
                            },
                            {
                                "tags": {"desc_type" : "default"},            
                                "content": "",
                                "subcontent": [
                                    
                                    {
                                        "tags": {"desc_type" : "bold"},            
                                        "content": "Destroy Supplies: "
                                    },
                                    {
                                        "tags": {"desc_type" : "default"},            
                                        "content": "The model that has Claimed a crate, or that is extracting it, can attack it as an ACTION. If successful, the crate is destroyed, in which case remove the Objective Marker representing the destroyed supplies from the table.",
                                        "glossary": [
                                            {"val": "ACTION", "id": "kw_action"}
                                        ]
                                    }
                                ]
                            },
                            {
                                "tags": {"desc_type" : "default"},            
                                "content": "",
                                "subcontent": [
                                    
                                    {
                                        "tags": {"desc_type" : "bold"},            
                                        "content": "Use Supplies: "
                                    },
                                    {
                                        "tags": {"desc_type" : "default"},            
                                        "content": "As an ACTION, a model that has Claimed a crate can attempt to open it and use the relics inside. If successful, gain a BLESSING MARKER, in which case remove the Objective Marker representing the used crate from the table.",
                                        "glossary": [
                                            {"val": "ACTION", "id": "kw_action"},
                                            {"val": "BLESSING MARKER", "id": "kw_blessingmarker"}
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "tags": {"desc_type" : "paragraph"},            
                "content": "An enemy model cannot attack a crate that has been Claimed, or that is being extracted by another model, but they can attack the model normally. "
            },
            {
                "tags": {"desc_type" : "paragraph"},            
                "content": "If the model that has Claimed a crate, or is extracting it, is taken Out of Action, the crate is immediately dropped within 3” of the fallen model, in a direction of the enemy’s choice. If it lands in contact with another model, the model can immediately Claim it, except if they’re engaged in melee combat with an enemy model, in which case the crate must be dropped again in a different direction. "
            },
            {
                "tags": {"desc_type" : "paragraph"},            
                "content": "If the game ends while a model has a Claimed crate, or is in the process of extracting it, they have failed to either extract it, destroy it or use it, and so it does not count towards the final VPs calculation."
            }
        ],
        "options": []
    }
]